cfe llm/InformationRegisters/AI_АгентскиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_АгентскиеОперации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_СтатусАгентскойОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийЭтап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемныйПромт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКонтекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДиалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаДиалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийIDОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйIDОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФоновогоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаЗапрошена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящиеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходящиеТокены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокеныИнструментов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийНомерШага</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящиеТокеныВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходящиеТокеныВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВложений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Comment/><Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДоступаКДанным</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_ПрофилиДоступаКДанным</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСценария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКорреляции</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдемпотентныйКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючИсточника</Name>					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтекста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстJSON</Name>					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенВыполнения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АрендаДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующаяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПовтор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОчищены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОтветаJSON</Name>
					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаДоставки</Name>
					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСистемногоПромта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураМодели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксТокеновМодели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_СтатусАгентскойОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_СтатусАгентскойОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗапрошена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/CommonModules/AI_ДиспетчерОпераций/Ext/Module.bsl
// Диспетчер выполняется от имени инициатора. Задание регламента обслуживает
// операции своего пользователя; пользовательский опрос обслуживает свою очередь.
Процедура ОбработатьОчередь() Экспорт

	Если ТранзакцияАктивна() Тогда
		Возврат;
	КонецЕсли;
	ИсходныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ВосстановитьПрерванныеОперации();
		ДоставитьОжидающиеРезультаты();
		ОчиститьУстаревшиеДанные();
		AI_НаблюдаемостьОпераций.ОчиститьТекстыОценок();
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 100
			| Операции.ИдентификаторОперации
			|ИЗ РегистрСведений.AI_АгентскиеОперации КАК Операции
			|ГДЕ Операции.Статус = &Очередь
			| И Операции.ИдентификаторПользователя = &Пользователь
			| И Операции.СледующаяПопытка <= &Сейчас
			|УПОРЯДОЧИТЬ ПО Операции.Приоритет УБЫВ, Операции.ДатаСоздания");
		Запрос.УстановитьПараметр("Очередь", Перечисления.AI_СтатусАгентскойОперации.ВОчереди);
		Запрос.УстановитьПараметр("Пользователь", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
		Запрос.УстановитьПараметр("Сейчас", ТекущаяДатаСеанса());
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Токен = Захватить(Выборка.ИдентификаторОперации);
			Если Токен = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Аргументы = Новый Массив;
			Аргументы.Добавить(Выборка.ИдентификаторОперации);
			Аргументы.Добавить(Токен);
			Попытка
				Задание = ФоновыеЗадания.Выполнить(
					"AI_АгентскиеОперацииСервер.ВыполнитьОперацию",
					Аргументы, "AI_Операция_" + Строка(Выборка.ИдентификаторОперации),
					"Агентская операция");
				НачатьТранзакцию();
				ЗаблокироватьОчередь();
				Запись = ПрочитатьОперацию(Выборка.ИдентификаторОперации);
				Если Запись.ТокенВыполнения = Токен Тогда
					Запись.ИдентификаторФоновогоЗадания = Задание.УникальныйИдентификатор;
					Запись.Записать();
				КонецЕсли;
				ЗафиксироватьТранзакцию();
			Исключение
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				// Запись сохранена. Истекшая незапущенная аренда будет восстановлена.
				ЗаписьЖурналаРегистрации("AI.Диспетчер", УровеньЖурналаРегистрации.Ошибка,
					, , КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЦикла;
	Исключение
		УстановитьПривилегированныйРежим(ИсходныйРежим);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ИсходныйРежим);

КонецПроцедуры

// Короткая общая блокировка сериализует только распределение слотов.
Процедура ЗаблокироватьОчередь() Экспорт
	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("РегистрСведений.AI_АгентскиеОперации");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
КонецПроцедуры

Функция Захватить(ИдентификаторОперации) Экспорт
	НачатьТранзакцию();
	Попытка
		ЗаблокироватьОчередь();
		Запись = ПрочитатьОперацию(ИдентификаторОперации);
		Если Не Запись.Выбран()
			Или Запись.Статус <> Перечисления.AI_СтатусАгентскойОперации.ВОчереди
			Или Запись.ОтменаЗапрошена
			Или Запись.СледующаяПопытка > ТекущаяДатаСеанса()
			Или Запись.ИдентификаторПользователя <> ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор Тогда
			ЗафиксироватьТранзакцию();
			Возврат Неопределено;
		КонецЕсли;
		ЛимитВсего = Константы.AI_КоличествоПотоковОбработкиОчереди.Получить();
		Если ЛимитВсего <= 0 Тогда
			ЛимитВсего = 4;
		КонецЕсли;
		ЛимитПровайдера = Запись.Провайдер.МаксКоличествоПотоков;
		Если ЛимитПровайдера <= 0 Тогда
			ЛимитПровайдера = 1;
		КонецЕсли;
		Запрос = Новый Запрос(
			"ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Всего,
			| ЕСТЬNULL(СУММА(ВЫБОР КОГДА О.Провайдер = &Провайдер ТОГДА 1 ИНАЧЕ 0 КОНЕЦ), 0) КАК Провайдер
			|ИЗ РегистрСведений.AI_АгентскиеОперации КАК О
			|ГДЕ О.Статус В (&Выполняется, &Отмена)");
		Запрос.УстановитьПараметр("Провайдер", Запись.Провайдер);
		Запрос.УстановитьПараметр("Выполняется", Перечисления.AI_СтатусАгентскойОперации.Выполняется);
		Запрос.УстановитьПараметр("Отмена", Перечисления.AI_СтатусАгентскойОперации.ОтменаЗапрошена);
		Слоты = Запрос.Выполнить().Выбрать();
		Слоты.Следующий();
		Если Слоты.Всего >= ЛимитВсего Или Слоты.Провайдер >= ЛимитПровайдера Тогда
			ЗафиксироватьТранзакцию();
			Возврат Неопределено;
		КонецЕсли;
		Токен = Новый УникальныйИдентификатор;
		Запись.ТокенВыполнения = Токен;
		Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.Выполняется;
		Запись.ТекущийЭтап = "Ожидание запуска обработчика";
		Запись.НачалоПопытки = Дата(1, 1, 1);
		Запись.АрендаДо = ТекущаяДатаСеанса() + 120;
		Запись.ИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		Запись.ДатаИзменения = ТекущаяДатаСеанса();
		Запись.Версия = Запись.Версия + 1;
		Запись.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	Возврат Токен;
КонецФункции

Функция НачатьПопытку(ИдентификаторОперации, Токен) Экспорт
	НачатьТранзакцию();
	Попытка
		ЗаблокироватьОчередь();
		Запись = ПрочитатьОперацию(ИдентификаторОперации);
		Допустима = Запись.Выбран()
			И Запись.ТокенВыполнения = Токен
			И Не ЗначениеЗаполнено(Запись.НачалоПопытки)
			И Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.Выполняется
			И Запись.ИдентификаторПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
		Если Допустима Тогда
			Запись.НачалоПопытки = ТекущаяДатаСеанса();
			Если Не ЗначениеЗаполнено(Запись.ДатаПервогоЗапуска) Тогда
				Запись.ДатаПервогоЗапуска = Запись.НачалоПопытки;
			КонецЕсли;
			Запись.КоличествоПопыток = Запись.КоличествоПопыток + 1;
			Запись.АрендаДо = ТекущаяДатаСеанса() + 3600;
			Запись.Записать();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	Возврат Допустима;
КонецФункции

Процедура ВосстановитьПрерванныеОперации()
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 100 О.ИдентификаторОперации
		|ИЗ РегистрСведений.AI_АгентскиеОперации КАК О
		|ГДЕ О.Статус В (&Выполняется, &Отмена)
		| И О.АрендаДо < &Сейчас И О.ИдентификаторПользователя = &Пользователь");
	Запрос.УстановитьПараметр("Выполняется", Перечисления.AI_СтатусАгентскойОперации.Выполняется);
	Запрос.УстановитьПараметр("Отмена", Перечисления.AI_СтатусАгентскойОперации.ОтменаЗапрошена);
	Запрос.УстановитьПараметр("Сейчас", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Пользователь", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			ЗаблокироватьОчередь();
			Запись = ПрочитатьОперацию(Выборка.ИдентификаторОперации);
			Если Не Запись.Выбран() Или Запись.АрендаДо >= ТекущаяДатаСеанса()
				Или (Запись.Статус <> Перечисления.AI_СтатусАгентскойОперации.Выполняется
				И Запись.Статус <> Перечисления.AI_СтатусАгентскойОперации.ОтменаЗапрошена) Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			Задание = Неопределено;
			Если ЗначениеЗаполнено(Запись.ИдентификаторФоновогоЗадания) Тогда
				Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Запись.ИдентификаторФоновогоЗадания);
			КонецЕсли;
			Если Задание <> Неопределено И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			Если Запись.ОтменаЗапрошена Тогда
				Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.Отменена;
				Запись.ТекущийЭтап = "Операция отменена";
				Запись.ДатаЗавершения = ТекущаяДатаСеанса();
			ИначеЕсли Не ЗначениеЗаполнено(Запись.НачалоПопытки) Тогда
				Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.ВОчереди;
				Запись.ТекущийЭтап = "Повтор запуска обработчика";
			Иначе
				Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.Ошибка;
				Запись.ТекстОшибки = "Обработчик прерван. Результат внешних действий неизвестен; автоматический повтор запрещен.";
				Запись.ТекущийЭтап = "Обработчик прерван";
				Запись.ДатаЗавершения = ТекущаяДатаСеанса();
			КонецЕсли;
			Запись.ТокенВыполнения = Новый УникальныйИдентификатор;
			Запись.ДатаИзменения = ТекущаяДатаСеанса();
			Запись.Версия = Запись.Версия + 1;
			Запись.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ПрочитатьОперацию(ИдентификаторОперации)
	Запись = РегистрыСведений.AI_АгентскиеОперации.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторОперации = ИдентификаторОперации;
	Запись.Прочитать();
	Возврат Запись;
КонецФункции

// Сохраняем tombstone и идемпотентный ключ. Вложения имеют отдельную политику хранения.
Процедура ОчиститьУстаревшиеДанные()
	Дней = Константы.AI_СрокХраненияОперацийДней.Получить();
	Если Дней <= 0 Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 100 О.ИдентификаторОперации
		|ИЗ РегистрСведений.AI_АгентскиеОперации КАК О
		|ГДЕ О.КодСценария <> """" И НЕ О.ДанныеОчищены
		| И О.СтатусДоставки <> ""Ожидает""
		| И О.ИдентификаторПользователя = &Пользователь
		| И О.ДатаЗавершения > &ПустаяДата И О.ДатаЗавершения < &Граница
		| И О.Статус В (&Завершена, &Ошибка, &Отменена)");
	Запрос.УстановитьПараметр("Пользователь", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запрос.УстановитьПараметр("Граница", ТекущаяДатаСеанса() - Дней * 86400);
	Запрос.УстановитьПараметр("Завершена", Перечисления.AI_СтатусАгентскойОперации.Завершена);
	Запрос.УстановитьПараметр("Ошибка", Перечисления.AI_СтатусАгентскойОперации.Ошибка);
	Запрос.УстановитьПараметр("Отменена", Перечисления.AI_СтатусАгентскойОперации.Отменена);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			ЗаблокироватьОчередь();
			Запись = ПрочитатьОперацию(Выборка.ИдентификаторОперации);
			Запись.Промт = "";
			Запись.СистемныйПромт = "";
			Запись.ДанныеКонтекста = "";
			Запись.КонтекстJSON = "";
			Запись.СхемаОтветаJSON = "";
			Запись.ОшибкаДоставки = "";
			Запись.Результат = "";
			Запись.ТекстОшибки = "";
			Запись.КлючИсточника = "";
			Запись.ПредставлениеИсточника = "";
			Запись.Источник = Неопределено;
			Запись.ДанныеОчищены = Истина;
			Запись.Версия = Запись.Версия + 1;
			Запись.ДатаИзменения = ТекущаяДатаСеанса();
			Запись.Записать();
			Шаги = РегистрыСведений.AI_ШагиАгентскихОпераций.СоздатьНаборЗаписей();
			Шаги.Отбор.ИдентификаторОперации.Установить(Выборка.ИдентификаторОперации);
			Шаги.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ДоставитьОжидающиеРезультаты()
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 100 ИдентификаторОперации
		|ИЗ РегистрСведений.AI_АгентскиеОперации
		|ГДЕ СтатусДоставки = ""Ожидает"" И ИдентификаторПользователя = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Аргументы = Новый Массив;
		Аргументы.Добавить(Выборка.ИдентификаторОперации);
		Попытка
			ФоновыеЗадания.Выполнить("AI_КонтрактыОпераций.ДоставитьРезультат", Аргументы,
				"AI_Доставка_" + Строка(Выборка.ИдентификаторОперации), "Доставка результата агента");
		Исключение
			ЗаписьЖурналаРегистрации("AI.Доставка", УровеньЖурналаРегистрации.Предупреждение,
				, , КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры
